; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph0 - mode
	thermograph1 - mode
	Star0 - direction
	Star2 - direction
	Star3 - direction
	Star4 - direction
	Star1 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star4)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star4)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
)
(:goal (and
	(have_image Planet5 thermograph0)
	(have_image Planet6 thermograph0)
	(have_image Star7 thermograph0)
	(have_image Star8 thermograph0)
	(have_image Phenomenon9 thermograph0)
	(have_image Star10 thermograph1)
	(have_image Phenomenon11 thermograph1)
	(have_image Phenomenon12 thermograph1)
	(have_image Planet13 thermograph0)
	(have_image Planet14 thermograph1)
	(have_image Planet15 thermograph0)
	(have_image Phenomenon16 thermograph1)
	(have_image Phenomenon17 thermograph1)
))

)

; plan
1. (turn_to satellite0 star4 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star4)
   goals met: 0 of 13
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 13
3. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 13
4. (turn_to satellite0 phenomenon16 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon16)
   goals met: 0 of 13
5. (take_image satellite0 phenomenon16 instrument1 thermograph1)
   added: (have_image phenomenon16 thermograph1)
   goals met: 1 of 13
6. (turn_to satellite0 phenomenon12 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 13
7. (take_image satellite0 phenomenon12 instrument1 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 2 of 13
8. (turn_to satellite0 phenomenon11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 13
9. (take_image satellite0 phenomenon11 instrument1 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 3 of 13
10. (turn_to satellite0 phenomenon17 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon17)
   goals met: 3 of 13
11. (take_image satellite0 phenomenon17 instrument1 thermograph1)
   added: (have_image phenomenon17 thermograph1)
   goals met: 4 of 13
12. (turn_to satellite0 phenomenon9 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 13
13. (take_image satellite0 phenomenon9 instrument1 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 5 of 13
14. (turn_to satellite0 planet13 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet13)
   goals met: 5 of 13
15. (take_image satellite0 planet13 instrument1 thermograph0)
   added: (have_image planet13 thermograph0)
   goals met: 6 of 13
16. (turn_to satellite0 planet14 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet14)
   goals met: 6 of 13
17. (take_image satellite0 planet14 instrument1 thermograph1)
   added: (have_image planet14 thermograph1)
   goals met: 7 of 13
18. (turn_to satellite0 planet15 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet15)
   goals met: 7 of 13
19. (take_image satellite0 planet15 instrument1 thermograph0)
   added: (have_image planet15 thermograph0)
   goals met: 8 of 13
20. (turn_to satellite0 planet5 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet5)
   goals met: 8 of 13
21. (take_image satellite0 planet5 instrument1 thermograph0)
   added: (have_image planet5 thermograph0)
   goals met: 9 of 13
22. (turn_to satellite0 planet6 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet6)
   goals met: 9 of 13
23. (take_image satellite0 planet6 instrument1 thermograph0)
   added: (have_image planet6 thermograph0)
   goals met: 10 of 13
24. (turn_to satellite0 star10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star10)
   goals met: 10 of 13
25. (take_image satellite0 star10 instrument1 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 11 of 13
26. (turn_to satellite0 star7 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star7)
   goals met: 11 of 13
27. (take_image satellite0 star7 instrument1 thermograph0)
   added: (have_image star7 thermograph0)
   goals met: 12 of 13
28. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 12 of 13
29. (take_image satellite0 star8 instrument1 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 13 of 13
